zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/project.c
#include "management.h"
#include "project.h"
#include "misc.h"
#include "actions.h"

#include "simplc_io.h"
#include "simplc_timer.h"

#include <stm8s.h>
#include "io.h"
#include "uart1.h"
#include "tm1638.h"
#include "flash_eeprom.h"
#include "24cxx.h"
#include "tim5.h"

const InternalSetting_TypeDef defaultInternalSetting[INTERNALSETTING_COUNT] = 
{
  {0, 0, 1}, //恢复出厂设置   1:恢复
  {1, 1, 254}, //调节动作延时的最小延时单位
  {0, 0, 1}, //设备识别  0：4sensors 1:2sensors
  {0, 0, 1}, //传感器电平 0:5V 1:12Vs
};

const ACTION_TypeDef process0[] = {{0, ACTION_NONE, 0}};
const ACTION_TypeDef process1[] = {{1, ABSORB, 0}, {1, FRONT, 0}, {1, PRINT, 0}, {1, PUSH, 0}, {1, PRINT, 0}, {1, HOME, 0}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process2[] = {{1, ABSORB, 0}, {1, FRONT, 0}, {1, PRINT, 0}, {0, PUSH, 0}, {0, PRINT, 0}, {1, HOME, 0}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process3[] = {{1, ABSORB, 0}, {1, FRONT, 0}, {1, PRINT, 0}, {1, PUSHHOME, 0}, {1, HOME, 0}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process4[] = {{1, ABSORB, 0}, {1, FRONT, 0}, {1, PRINT, 0}, {0, PUSHHOME, 0}, {1, HOME, 0}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process5[] = {{1, ABSORB, 0}, {1, FRONT, 0}, {1, PRINT, 0}, {1, SHIFT, 0}, {1, PRINT,  0}, {1, SHIFT, 0}, {1, PRINT, 0}, {1, SHIFT, 0}, {1, PRINT, 0}, {1, HOME, 0}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process6[] = {{1, ABSORB, 0}, {1, FRONT, 0}, {1, PRINT, 0}, {0, SHIFT, 0}, {0, PRINT,  0}, {0, SHIFT, 0}, {0, PRINT, 0}, {0, SHIFT, 0}, {0, PRINT, 0}, {1, HOME, 0}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process7[] = {{1, ABSORB, 0}, {1, FRONT, 0}, {1, PRINT, 0}, {1, SHIFT, 0}, {1, PRINT,  0}, {1, SHIFT, 0}, {1, PRINT, 0}, {1, SHIFT, 0}, {1, PRINT, 0}, {1, SHIFT, 0}, {1, PRINT, 0}, {1, SHIFT, 0}, {1, PRINT, 0}, {1, HOME, 0}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process8[] = {{1, ABSORB, 0}, {1, FRONT, 0}, {1, PRINT, 0}, {0, SHIFT, 0}, {0, PRINT,  0}, {0, SHIFT, 0}, {0, PRINT, 0}, {0, SHIFT, 0}, {0, PRINT, 0}, {0, SHIFT, 0}, {0, PRINT, 0}, {0, SHIFT, 0}, {0, PRINT, 0}, {1, HOME, 0}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process9[] = {{1, ABSORB, 0}, {1, FRONT, 0}, {1, PRINT_DOWN, 0}, {1, SHIFT, 0}, {1, PRINT_UP,  0}, {1, HOME, 0}, {0, ACTION_NONE, 0}};

const ACTION_TypeDef process10[] = {{1, ABSORB, 0}, {1, FRONT, 0}, {1, PRINT, 0}, {1, PUSH2HOME, 0}, {1, HOME, 0}, {0, ACTION_NONE, 0}};

PROJECT_TypeDef project;

void Program0Read(void)
{
    uint8_t i, j;
    
    for(i=0,j=0;i<MAX_ACTIONS_PER_PROJECT;i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        project.program[i].delay = 1;
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        j += 3;
    }
}

//
void Program0Save(void)
{
    uint8_t i, j;
    
    for(i=0,j=0;i<MAX_ACTIONS_PER_PROJECT;i++)
    {
        project.program[i].flag = 1;
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        
        IWDG_ReloadCounter();
        
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);

        IWDG_ReloadCounter();
        
        project.program[i].delay = 0;
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);

        j += 3;
        
        IWDG_ReloadCounter();
        
        if(project.program[i].act == ACTION_NONE)//如果是最后，则退出
            break;
        
//        UART1_printf("project.program[%d].flag\r\n", i, project.program[i].flag);
//        UART1_printf("project.program[%d].act\r\n", i, project.program[i].act);
//        UART1_printf("project.program[%d].delay\r\n", i, project.program[i].delay);
    }
}

//程序恢复出厂设置
void ProgramResetDefault(void)
{
    uint16_t i, j;
    //uint8_t temp;
    
    UART1_printf("Program reset default data...\r\n");
    
    AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM_NUM, 1);
    AT24CXX_WriteLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 0, 2);//需要保存3次才能成功
    AT24CXX_WriteLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 0, 2);
    AT24CXX_WriteLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 0, 2);
    AT24CXX_WriteOneByte(EEPROM_ADDR_PRODUCTOUTPUTOFFSET, 0);
    AT24CXX_WriteOneByte(EEPROM_ADDR_PRODUCTOUTPUTOFFSET, 0);
    AT24CXX_WriteOneByte(EEPROM_ADDR_PRODUCTOUTPUTOFFSET, 0);
    AT24CXX_WriteOneByte(EEPROM_ADDR_MACHINETYPE, 0);
    AT24CXX_WriteOneByte(EEPROM_ADDR_MACHINETYPE, 0);
    AT24CXX_WriteOneByte(EEPROM_ADDR_MACHINETYPE, 0);
    AT24CXX_WriteOneByte(EEPROM_ADDR_SENSORLEVEL, 0);
    AT24CXX_WriteOneByte(EEPROM_ADDR_SENSORLEVEL, 0);
    AT24CXX_WriteOneByte(EEPROM_ADDR_SENSORLEVEL, 0);
    AT24CXX_WriteOneByte(EEPROM_ADDR_ACTIONUNIT, ACTIONUNIT_DELAY);
    AT24CXX_WriteOneByte(EEPROM_ADDR_ACTIONUNIT, ACTIONUNIT_DELAY);
    AT24CXX_WriteOneByte(EEPROM_ADDR_ACTIONUNIT, ACTIONUNIT_DELAY);
    AT24CXX_WriteOneByte(EEPROM_ADDR_ACTIONUNITDELAY, 1);
    AT24CXX_WriteOneByte(EEPROM_ADDR_ACTIONUNITDELAY, 1);
    AT24CXX_WriteOneByte(EEPROM_ADDR_ACTIONUNITDELAY, 1);
    
    UART1_printf("++++The default data is %d\r\n", AT24CXX_ReadOneByte(EEPROM_ADDR_DEFAULT));
    UART1_printf("++++The prgramNum is %d\r\n", AT24CXX_ReadOneByte(EEPROM_ADDR_PROGRAM_NUM));
    UART1_printf("++++The productOutput is %d\r\n", (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 2));
    UART1_printf("++++The productOutputOffset is %d\r\n", AT24CXX_ReadOneByte(EEPROM_ADDR_PRODUCTOUTPUTOFFSET));
    UART1_printf("++++The machineType is %d\r\n", AT24CXX_ReadOneByte(EEPROM_ADDR_MACHINETYPE));
    UART1_printf("++++The sensorLevel is %d\r\n", AT24CXX_ReadOneByte(EEPROM_ADDR_SENSORLEVEL));
    UART1_printf("++++The sensorLevel is %d\r\n", AT24CXX_ReadOneByte(EEPROM_ADDR_ACTIONUNIT));
    UART1_printf("++++The actionUnitDelay is %d\r\n", AT24CXX_ReadOneByte(EEPROM_ADDR_ACTIONUNITDELAY));
    
