zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/project.c
    UART1_printf("Program reset default data finish!\r\n");
}

//读取程序
void ProgramRead(void)
{
    uint16_t i, j;
    
    UART1_printf("Start reading Program...\r\n");
    
    IWDG_ReloadCounter();
    
    //初始化project结构体
    project.programNum = AT24CXX_ReadOneByte(EEPROM_ADDR_PROGRAM_NUM);//读取程序序号
    project.productOutputOffset = AT24CXX_ReadOneByte(EEPROM_ADDR_PRODUCTOUTPUTOFFSET);
    project.productOutputAddr = EEPROM_ADDR_PRODUCTOUTPUT + project.productOutputOffset;
    project.productOutput =  (uint16_t)AT24CXX_ReadLenByte(project.productOutputAddr, 2);
    
    IWDG_ReloadCounter();
    
    project.machineType = (MachineType_TypeDef)AT24CXX_ReadOneByte(EEPROM_ADDR_MACHINETYPE);
    project.sensorLevel = AT24CXX_ReadOneByte(EEPROM_ADDR_SENSORLEVEL);
    project.actionUnit = AT24CXX_ReadOneByte(EEPROM_ADDR_ACTIONUNIT);
    project.actionUnitDelay = ((uint16_t)AT24CXX_ReadOneByte(EEPROM_ADDR_ACTIONUNITDELAY))*((uint16_t)project.actionUnit);
    
    project.internalSetting[INTERNALSETTING_DEFAULT].val = defaultInternalSetting[INTERNALSETTING_DEFAULT].val;
    project.internalSetting[INTERNALSETTING_DEFAULT].min = defaultInternalSetting[INTERNALSETTING_DEFAULT].min;
    project.internalSetting[INTERNALSETTING_DEFAULT].max = defaultInternalSetting[INTERNALSETTING_DEFAULT].max;
    project.internalSetting[INTERNALSETTING_MACHINETYPE].val = project.machineType;
    project.internalSetting[INTERNALSETTING_MACHINETYPE].min = defaultInternalSetting[INTERNALSETTING_MACHINETYPE].min;
    project.internalSetting[INTERNALSETTING_MACHINETYPE].max = defaultInternalSetting[INTERNALSETTING_MACHINETYPE].max;
    project.internalSetting[INTERNALSETTING_SENSORLEVEL].val = project.sensorLevel;
    project.internalSetting[INTERNALSETTING_SENSORLEVEL].min = defaultInternalSetting[INTERNALSETTING_SENSORLEVEL].min;
    project.internalSetting[INTERNALSETTING_SENSORLEVEL].max = defaultInternalSetting[INTERNALSETTING_SENSORLEVEL].max;
    project.internalSetting[INTERNALSETTING_ACTIONUNIT].val = project.actionUnit;
    project.internalSetting[INTERNALSETTING_ACTIONUNIT].min = defaultInternalSetting[INTERNALSETTING_ACTIONUNIT].min;
    project.internalSetting[INTERNALSETTING_ACTIONUNIT].max = defaultInternalSetting[INTERNALSETTING_ACTIONUNIT].max;
    
    //project.actionUnitDelay = 1;
     
    IWDG_ReloadCounter();
    
    //刷新数码管
    sprintf((char*)project.segStr, "Pro%02d", project.programNum);
    TM1638_SendData(0, project.segStr);
    
//    UART1_printf("EEPROM_ADDR_PROGRAM0 = %d\r\n", EEPROM_ADDR_PROGRAM0);
//    UART1_printf("EEPROM_ADDR_PROGRAM1 = %d\r\n", EEPROM_ADDR_PROGRAM1);
//    UART1_printf("EEPROM_ADDR_PROGRAM2 = %d\r\n", EEPROM_ADDR_PROGRAM2);
//    UART1_printf("EEPROM_ADDR_PROGRAM3 = %d\r\n", EEPROM_ADDR_PROGRAM3);
//    UART1_printf("EEPROM_ADDR_PROGRAM4 = %d\r\n", EEPROM_ADDR_PROGRAM4);
//    UART1_printf("EEPROM_ADDR_PROGRAM5 = %d\r\n", EEPROM_ADDR_PROGRAM5);
//    UART1_printf("EEPROM_ADDR_PROGRAM6 = %d\r\n", EEPROM_ADDR_PROGRAM6);
//    UART1_printf("EEPROM_ADDR_PROGRAM7 = %d\r\n", EEPROM_ADDR_PROGRAM7);
//    UART1_printf("EEPROM_ADDR_PROGRAM8 = %d\r\n", EEPROM_ADDR_PROGRAM8);
//    UART1_printf("EEPROM_ADDR_PROGRAM9 = %d\r\n", EEPROM_ADDR_PROGRAM9);
    
    //读取当前选择的程序
    switch(project.programNum)
    {
        case 0:
            project.programAddr = EEPROM_ADDR_PROGRAM0;
            project.platformHomeFlag = 1;
        break;
        case 1:
            project.programAddr = EEPROM_ADDR_PROGRAM1;
            project.platformHomeFlag = 1;
        break;
        case 2:
            project.programAddr = EEPROM_ADDR_PROGRAM2;
            project.platformHomeFlag = 0;
        break;
        case 3:
            project.programAddr = EEPROM_ADDR_PROGRAM3;
            project.platformHomeFlag = 1;
        break;
        case 4:
            project.programAddr = EEPROM_ADDR_PROGRAM4;
            project.platformHomeFlag = 0;
        break;
        case 5:
            project.programAddr = EEPROM_ADDR_PROGRAM5;
            project.platformHomeFlag = 1;
        break;
        case 6:
            project.programAddr = EEPROM_ADDR_PROGRAM6;
            project.platformHomeFlag = 0;
        break;
        case 7:
            project.programAddr = EEPROM_ADDR_PROGRAM7;
            project.platformHomeFlag = 1;
        break;
        case 8:
            project.programAddr = EEPROM_ADDR_PROGRAM8;
            project.platformHomeFlag = 0;
        break;
        case 9:
            project.programAddr = EEPROM_ADDR_PROGRAM9;
            project.platformHomeFlag = 1;
        break;
        case 10:
            project.programAddr = EEPROM_ADDR_PROGRAM10;
            project.platformHomeFlag = 1;
        break;
        default:
            project.programAddr = EEPROM_ADDR_PROGRAM2;
            project.platformHomeFlag = 0;
        break;
    }

    i = 0;
    j = 0;
    project.program[j].flag = AT24CXX_ReadOneByte(project.programAddr+i);
    project.program[j].act = (ACT_TypeDef)AT24CXX_ReadOneByte(project.programAddr+i+1);
    project.program[j].delay = AT24CXX_ReadOneByte(project.programAddr+i+2);
    UART1_printf("----project.program[%d].flag = %d\r\n", j, project.program[j].flag);
    UART1_printf("----project.program[%d].act = %d\r\n", j, project.program[j].act);
    UART1_printf("----project.program[%d].delay = %d\r\n", j, project.program[j].delay);
    project.actionCnt = 1;
    
    IWDG_ReloadCounter();
    
    while(project.program[j].act != ACTION_NONE)
    {
        i += 3;
        j++;
        if(j >= 40) break;
        project.program[j].flag = AT24CXX_ReadOneByte(project.programAddr+i);
        project.program[j].act = (ACT_TypeDef)AT24CXX_ReadOneByte(project.programAddr+i+1);
        project.program[j].delay = AT24CXX_ReadOneByte(project.programAddr+i+2);
        UART1_printf("----project.program[%d].flag = %d\r\n", j, project.program[j].flag);
        UART1_printf("----project.program[%d].act = %d\r\n", j, project.program[j].act);
        UART1_printf("----project.program[%d].delay = %d\r\n", j, project.program[j].delay);
        project.actionCnt++;
        
        IWDG_ReloadCounter();
    }
    
