zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/project.c
    project.actionCnt--;
    project.actionPos = 0;
    project.pCurAction = project.program;
    project.delay = project.pCurAction->delay;
    
    if(project.pCurAction->act == ABSORB
       || project.pCurAction->act == ABSORB_DOWN
       || project.pCurAction->act == PRINT
       || project.pCurAction->act == PRINT_DOWN)
    {
        SML(M_CAN_CHANGE_DELAY, 1);
    }
    else
        SML(M_CAN_CHANGE_DELAY, 0);
    
    UART1_printf("\r\n");
    UART1_printf("----The Program num is %d\r\n", project.programNum);
    UART1_printf("----The Program address is %d\r\n", project.programAddr);
    UART1_printf("----The Program action count is %d\r\n", project.actionCnt);

    IWDG_ReloadCounter();
    
    UART1_printf("EEPROM_ADDR_END = %d\r\n", EEPROM_ADDR_END);
    
    UART1_printf("----The productOutput is %d\r\n", project.productOutput);
    UART1_printf("----The productOutputOffset is %d\r\n", project.productOutputOffset);
    UART1_printf("----The productOutputAddr is %d\r\n", project.productOutputAddr);
    UART1_printf("----The actionUnit is %d\r\n", project.actionUnit);
    UART1_printf("----The actionUnitDelay is %d\r\n", project.actionUnitDelay);
    
    IWDG_ReloadCounter();
    
    if(project.sensorLevel)
        UART1_printf("++++++++This is a 12V sensors machine!!!!\r\n");
    else
        UART1_printf("++++++++This is a 5V sensors machine!!!!\r\n");
    
    if(project.machineType)
        UART1_printf("++++++++This is a 2 sensors machine!!!!\r\n");
    else
        UART1_printf("++++++++This is a 4 sensors machine!!!!\r\n");
    
    IWDG_ReloadCounter();
}

void Project_Run(void)
{
    //产量清0
    if(GMR(M_KEY_CLEAR))
    {
        project.productOutput = 0;
        sprintf((char*)project.segStr, "%05d", project.productOutput);
        TM1638_SendData(0, project.segStr);
        
        AT24CXX_WriteLenByte(project.productOutputAddr, 0, 2);
        AT24CXX_WriteLenByte(project.productOutputAddr, 0, 2);
        AT24CXX_WriteLenByte(project.productOutputAddr, 0, 2);
    }
    
    //按键声音
    Key_Sound();
    
    //LED灯
    LED_RedGreen();
      
    //上电
    if(GMR(M_POWERON))
    {
        if(GML(M_KEY_FRONTBACK))//选择程序
        {
            project.mode = PROGRAM_SEL;
            SML(M_PROGRAM_SEL, 1);
            
            UART1_printf("Bootloader : Program select...\r\n");
        }
        else if(GML(M_KEY_UPDOWN))
        {
            //project.mode = PROGRAM_SELF;
            
            SML(M_PROGRAM_SELF, 1);
            
            UART1_printf("Bootloader : Program self...\r\n");
        }
        else if(GML(M_KEY_FAST))
        {
            SML(M_PROGRAM_HEAD_CHECK, 1);
            
            UART1_printf("Bootloader : Machine sensors head check...\r\n");
        }
        else if(GML(M_KEY_SLOW))
        {
            SML(M_PROGRAM_PLATFORM_CHECK, 1);
            
            UART1_printf("Bootloader : Machine sensors platform check...\r\n");
        }
        else//正常启动
        {
            project.mode = NORMAL;
            SML(M_PROGRAM_READ, 1);
            
            UART1_printf("Bootloader : Normal...\r\n");
        }
    }
    
    if(GML(M_PROGRAM_HEAD_CHECK))
    {
        MachineSensorsHead_Check();
    }
    else if(GML(M_PROGRAM_PLATFORM_CHECK))
    {
        MachineSensorsPlatform_Check();
    }
    
    if(!GML(M_ONCE) && GML(M_PROGRAM_SELF) && GMF(M_KEY_UPDOWN))
    {
        SML(M_ONCE, 1);
      
        project.mode = PROGRAM_SELF;
        
        ProgramRead();
        
        project.programSelfPos = 0;
        
        sprintf((char*)project.segStr, "%02d-", project.programSelfPos);
        TM1638_SendData(0, project.segStr);
        
        project.pCurProSelfAction = project.program + project.programSelfPos;
        
        sprintf((char*)project.segStr, "%02d", project.pCurProSelfAction->act);
        TM1638_SendData(3, project.segStr);
    }

    //检查HOME是否回位到位
    if(GML(M_HOME_CHECK))
        Home_Check();

    //检查PUSH是否回位到位
    if(GML(M_PUSH_CHECK))
        Push_Check();
    if(GML(M_PUSH2_CHECK))
        Push2_Check();
    
    //模式选择
    if(project.mode == PROGRAM_SEL)//选择程序
    {
        ProgramSelect();
    }
    else if(project.mode == PROGRAM_SELF)//自编程
    {
        ProgramSelf();
    }
    else if(project.mode == NORMAL)//正常启动
    {
        //读取程序编号
        if(GML(M_PROGRAM_READ))
        {
            ProgramRead();
            
            SML(M_PROGRAM_READ, 0);
            
            SML(M_SEG_FLASH, 1);
        }
        
        //数码管闪烁--显示当前选择的程序
        if(GML(M_SEG_FLASH))
            Segment_Flash();
        
        if(GML(M_MACHINE_CHECK))
        {
            MachineType_Check();
            SML(M_MACHINE_CHECK, 0);
            SML(M_PROGRAM_READY, 1);
        }
        
        //按键识别
        if(GML(M_PROGRAM_READY))
            Key_Distinguish();

        //产量闪烁
        if(GML(M_OUTPUT_FLASH_FLAG))
            Output_Flash();
        
        IWDG_ReloadCounter();
        
/***********************************执行动作***********************************/
        if(GML(M_MODE_AUTO))
        {
            if(GML(M_PUSH_CHECK) && (project.pCurAction->act == PUSH))//如果前一动作是PUSH，则需等到PUSH完成
            {
                UART1_printf("Waiting for last Push finish...\r\n");
            }
            else
            {
                //每个动作都有的一段延时
                if(project.delay)//需要延时
                {
                    if(!GML(M_ACTION_DELAY))
                    {
                        TS(0, project.actionUnitDelay);//动作延时最小单位
                        SML(M_ACTION_DELAY, 1);
                    }
                    else if(TG(0))
                    {
                        project.delay--;
                        SML(M_ACTION_DELAY, 0);
                    }
                }
                else//延时时间到
                {
                    switch(project.pCurAction->act)//动作识别
                    {
                        case ABSORB_DOWN://吸油下
                            AbsorbDown();
                        break;
                        case ABSORB_UP://吸油上
                            AbsorbUp();
                        break;
                        case ABSORB://吸油
                            Absorb();
                        break;
                        case FRONT://前进
                            Front();
                        break;
                        case BACK://后退
                            Back();
                        break;
                        case PRINT_DOWN://印油下
                            PrintDown();
                        break;
                        case PRINT_UP://印油上
                            PrintUp();
                        break;
                        case PRINT://印油
                            Print();
                        break;
                        case SHIFT://移位
                            Shift();
                        break;
                        case RETURN://回位
                            Return();
                        break;
                        case PUSH://推送
                            Push();
                        break;
                        case PUSHHOME:
                            PushHome();
                        break;
                        case HOME://回原点
                            Home();
                        break;
                        case PUSH2HOME://回原点
                            Push2Home();
                        break;
                        default:
                        break;
                    }//动作识别
                }//延时时间到
            }
        }
        
 /***************************************执行手动程序******************************/
        if(GML(M_MODE_MANUAL))
        {
            if(GML(M_MAN_UPDOWN))
            {
                if(!GML(M_MAN_FRONTBACK))
                {
                    if(project.programNum == 9)
                    {
                        if(project.printHeadPos&FRONTBACK_MASK)
                        {
                            if(project.printHeadPos&UPDOWN_MASK)
                                PrintUp();
                            else
                                PrintDown();
                        }
                        else
                            Absorb();
                    }
                    else
                    {
                        if(project.printHeadPos&FRONTBACK_MASK)
                            Print();
                        else
                            Absorb();
                    }
                }
                else
                {
                    SML(M_MAN_UPDOWN, 0);
                    
                    SML(M_MAN_UPDOWN_FB, 1);
                }
            }
            if(GML(M_MAN_FRONTBACK) && !GML(M_MAN_UPDOWN))
            {
                if(project.printHeadPos&FRONTBACK_MASK)
                    Back();
                else
                    Front();
            }
            
            if(GML(M_MAN_AUX))
            {
                if(project.machineType == MACHINE_2SENSORS)
                {
                    if(!project.platformPushFlag)
                        Push();
                    else
                        Return();
                }
                else
                {
                    if(GML(M_MAN_AUX_RETURN))
                        Return();
                    else
                        Shift();
                }
                
                SML(M_MAN_FLAG_AUX, 1);
            }
            
            if(!GML(M_MAN_UPDOWN) && !GML(M_MAN_FRONTBACK) && !GML(M_MAN_AUX))
                SML(M_MODE_MANUAL, 0);
        }
      
/**************************************恢复自动状态************************************/        
        else if(GML(M_MODE_RESTORE))
        {
            //UART1_printf("Restore mode.\r\n");
          
            if(GML(M_RESTORE_UP))
            {
                if(project.printHeadPos&FRONTBACK_MASK)
                    PrintUp();
                else
                    AbsorbUp();
            }
            
            if(!GML(M_RESTORE_UP) && GML(M_RESTORE_HOME))
            {
//                if(project.platformHomeFlag)
                    Home();
//                else
//                {
//                    if(GML(M_PROGRAM_AUX))
//                        Home();
//                    else
//                        PrintHeadHome();
//                }
            }
            
            if(!GML(M_RESTORE_UP) && !GML(M_RESTORE_HOME))
            {
                SML(M_MODE_RESTORE, 0);
                SML(M_MODE_AUTO, 1);
                
                project.actionPos = 0;
                project.pCurAction = project.program + project.actionPos;
                project.delay = project.pCurAction->delay;
                
                UART1_printf("Restore finish.\r\n\r\n");
            }
        }
    }
}
